app/workers/chat-worker.rb

    def work(chat_data)
        chat_json = JSON.parse(chat_data)
        chat = Chat.new(chat_json)
        chat.save!
---
INSERT INTO `chats` (`number`, `application_id`, `message_count`, `created_at`, `updated_at`) VALUES (1, 1, 0, '2022-07-31 23:49:16', '2022-07-31 23:49:16')