app/workers/message-worker.rb

INSERT INTO `messages` (`number`, `body`, `chat_id`, `created_at`, `updated_at`) VALUES (3, 'hello world ', 1, '2022-08-01 00:29:35', '2022-08-01 00:29:35')
---
    def work(message_data)
        message_json = JSON.parse(message_data)
        message = Message.new(message_json)
        message.save!