app/controllers/applications_controller.rb

INSERT INTO `applications` (`access_token`, `name`, `chat_count`, `created_at`, `updated_at`) VALUES ('EwpnCVQ8Pzm8fb4PwirEhE1S', 'testings12', 0, '2022-08-01 01:19:45', '2022-08-01 01:19:45')
---
  def create
    @application = Application.new(application_params)
    @application.chat_count = 0
    if @application.save

UPDATE `applications` SET `name` = 'test keda', `updated_at` = '2022-08-01 01:19:54' WHERE `applications`.`id` = 1
---
  def update
    if @application.update(application_params)

SELECT  `applications`.* FROM `applications` WHERE `applications`.`access_token` = '7kW4MBk5UP1F5LzpcxfhFDLx' LIMIT 1
---
    def set_application
      @application = Application.where(access_token: params[:id])