app/controllers/chats_controller.rb

SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 2
---
  def index
    @chats = Chat.where(application_id: @application.id)

DELETE FROM `chats` WHERE `chats`.`id` = 1
SELECT  `chats`.* FROM `chats` WHERE `chats`.`application_id` = 1 AND `chats`.`number` = 1 LIMIT 1
---
  def destroy
    @application.chats.where(number: params[:number]).destroy

SELECT  `applications`.* FROM `applications` WHERE `applications`.`access_token` = 'gT5wrPf8UcjB5wNJN8Lj6srx' LIMIT 1
---
    def set_application
      @application = Application.find_by!(access_token: params[:application_id])