app/controllers/messages_controller.rb

UPDATE `messages` SET `body` = 'hello world yes', `updated_at` = '2022-08-01 01:28:25' WHERE `messages`.`id` = 1
---
  def update
    if @message.update(message_params)

DELETE FROM `messages` WHERE `messages`.`id` = 1
---
  def destroy
    @message.destroy

SELECT  `applications`.* FROM `applications` WHERE `applications`.`access_token` = 'dTFRZdkoob3BP22zYKpTeUSm' LIMIT 1
---
    def set_application
      @application = Application.find_by!(access_token: params[:application_id])

SELECT  `chats`.* FROM `chats` WHERE `chats`.`application_id` = 1 AND `chats`.`number` = 1 LIMIT 1
---
    def set_chat
      @chat = @application.chats.find_by!(number: params[:chat_number])